[    
   {  
      "subheading":"Welcome",
       "name":"Welcome",
      "id":0,
	  "type":"animation",
      "url":"templates/slide1.html",
      "transcript":"Welcome to this training on IT MICS for Control Owners: Foundation! <br/><br/>In this module we will look at:<br/><br/>1. The categorization of IT solutions at ABI<br/><br/>2. The key components and risks of each of the IT MICS domains<br/><br/>Please click on Next to proceed."
   },
   {  
      "subheading":"IT Solution Categorization",
       "name":"IT Solution Categorization",
      "id":1,
	  "type":"animation",
      "url":"templates/slide1_1.html",
      "transcript":"IT Solution Categorization<br/><br/>At ABI, IT solutions can be categorized into 5 categories–<br/><br/>SOX Audit Scope or Statutory Reporting scope, Business Impact analysis, Data Privacy relevant, Crown Jewels and Exposed to external vulnerabilities.<br/><br/>1. SOX Audit scope solutions are critical for financial reporting<br/><br/>2. Business Impact Analysis helps in determining availability of IT solutions<br/><br/>3. Data Privacy Impact assessment identifies privacy risks and is critical for regulatory and legal compliance<br/><br/>4. Crown jewels are of significant value and can cause major business impact if compromised<br/><br/>5. External Vulnerabilities that may arise due to internet facing access points"
   },
    {  
      "subheading":"IT MICS Domains",
       "name":"IT MICS Domains",
      "id":2,
	  "type":"activity",
      "url":"templates/slide2.html",
      "transcript":"IT MICS Domains<br/><br/>Let’s begin the learning by clicking through each of the tiles.<br/><br/><br/><br/>Access management<br/><br/>Introduction and Importance: Access management encompasses the processes, rules and deployment mechanisms that control access to information systems, resources and physical access to premises. It is based on the principles of least privilege and segregation of duties or SOD.<br/>Key risks: Absence of adequate controls around access management may lead to unauthorized access to organization’s IT systems.<br/>Key components- Some of the key components of access management include:<br/>— Access granting – Process of providing access to users for various systems based on their respective roles, generally based on pre-defined rulesets<br/>— Access reviews – Process of periodically reviewing users’ access to IT systems<br/>— Access revocation – Process of access removal of unwanted or unauthorized users based on reviews or changes in user status such as role change and contract termination<br/>— Emergency access management – Emergency or firefighter access is a critical access that is only used in extraordinary circumstances for a limited period. It is necessary to implement and manage policies that govern emergency access to IT systems.<br/>— Third party access management – Ensuring that third parties who have access to organization’s IT systems are monitored and unauthorized access is prevented<br/>— SOD Ruleset - A basic internal control that prevents or detects errors and irregularities by assigning the responsibility for initiating and recording transactions to separate individuals<br/><br/><br/><br/>Change Management<br/><br/>Introduction and Importance: Change management is a systematic approach to dealing with the transition or transformation of an organization's goals, processes or technologies, to ensure that only appropriate changes are implemented. It further ensures that these changes, which may arise out of business or operational needs such as timely incident and problem resolution, are logged, reviewed and approved by required teams before implementation.<br/>Key risks: Absence of a standard change management process may lead to inappropriate modifications to IT solutions and disruption in services.<br/>Key components- Change management consists of the following key components: <br/>— Normal changes – Changes that are evaluated, authorized and then scheduled according to the standard change management process.<br/>— Emergency changes - Changes that must be introduced as soon as possible, generally to contain or prevent security incidents <br/>— Incident management - A set of procedures and actions taken to identify, respond and resolve IT incidents<br/>— Problem management - The process of identifying and managing the causes of repeated IT incidents<br/>— DevOps methodology – A practice that combines software development – Dev, with operations – Ops, to enable better communication and increase development efficiency and speed<br/>— Project management - The discipline of applying specific processes and principles to initiate, plan, execute and manage the way that new initiatives or changes are implemented within an organization<br/><br/><br/><br/>Application and Control Inventory<br/><br/>Introduction and Importance: Organizations need to classify and list all their IT solutions in a catalog or an ‘IT Solutions inventory’. This inventory helps in keeping track of purpose, owner, criticality, underlying OS and DB details. Further, a visual representation detailing the various IT components of the IT solution, called the IT solution architecture or technical map is required to be maintained.<br/>Key risks: Not inventorying all IT solutions may lead to lack of visibility into the IT landscape and result in IT controls not being applied to all solutions.<br/>Key components: Some of the key components of this domain include:<br/>— IT solution inventory management – The process of keeping a record of or inventorying all the software and applications used within an IT environment.<br/>— IT solution architecture/ Technical map – A diagram of the IT solution containing the different interfaces, network segmentations, access points, hosts, etc.<br/><br/><br/><br/>Business Continuity<br/><br/>Introduction and Importance: Business Continuity Management is a holistic process that identifies potential incidents that threaten an organization and provides a framework for building resilience and the capability for an effective response. These incidents must be dealt with before it stops the business process altogether, causing normal operations to reach a halting point.<br/>Key risks: Delayed or inappropriate response to such incidents can cause failure of business operations or slow down the recovery process.<br/>Key components- The following are the key components of Business Continuity Management:<br/>— Business Impact Analysis - The process of determining the criticality of business activities and associated resource requirements to ensure operational resilience and continuity of operations during and after a business disruption<br/>— Backup strategy – A plan to ensure that organizational data is backed up and available for restoration in the case of data loss<br/>— Disaster Recovery – Activities and programs designed to regain access and functionality to IT infrastructure after events like a natural disaster, cyber-attack, or other business disruptions.<br/><br/><br/><br/>Interfaces<br/><br/>Introduction and Importance: Organizations have multiple systems and IT solutions, which are interconnected and exchange information. Many such applications run batch jobs for various tasks such as report generations, creating requests, purging data etc. Batch job and interface management involves monitoring and reviewing the batch jobs running between IT systems, and the interfaces connecting them. <br/>Key Risks: Without adequate monitoring, any issues and failure of batch jobs or interfaces may lead to incomplete job processing and inaccurate transfer of information.<br/>Key components- To prevent such failures, we must ensure the following key components are taken care of: <br/>— Batch job management – Managing routine jobs and batch processing to enable accurate and efficient processing of large sets of data <br/>— Interface management – Managing the boundary or connecting channel between two IT solutions for completeness and accuracy of information being transferred<br/><br/><br/><br/>Network Security<br/><br/>Introduction and Importance: Network security consists of the policies, processes and practices adopted to prevent, detect and monitor unauthorized access, misuse, modification, or denial of a computer network and network-accessible resources. One of the main ways in which network security can be enabled is through network segmentation. It is the act or practice of splitting a computer network into subnetworks, each being a network segment. Advantages of such splitting are primarily for boosting performance and improving security.<br/>Key risks: Absence of adequate network security can lead to exposure of vulnerabilities resulting in malware infection, social engineering attacks and phishing attack among others. <br/>Key components- Key components of this domain include:<br/>— Network architecture diagram - A visual representation of a computer or communications network which shows different components and how they interact, including routers, devices, hubs, firewalls, etc.<br/>— Secure network configuration - Security measures that are implemented when building and installing network devices in order to reduce unnecessary cyber vulnerabilities.<br/><br/><br/><br/>Automation<br/><br/>Introduction and Importance: Tedious or repetitive tasks can often be automated using Robotic Process Automation, or RPA. This is achieved by using software programs called ‘BOTS’ and can be designed to save on manpower and time. <br/>Key risks: Although RPA brings with it a huge array of benefits, not standardizing the automation process and not monitoring bots continuously can result in unwanted outcomes such as system performance issues, bots crashing and incorrect processing of data.<br/>Key components- The following are the key components of automation:<br/>— BOT inventory – The list of all BOTS that are deployed in an organization’s IT environment which include details on applications using the BOT, criticality, stage the BOT is in i.e. Design, UAT etc.<br/>— Monitoring of BOTS – Observing and reviewing BOT activity which helps in continuous improvement and identification of abnormal functioning<br/>— RPA compliance – Adherence to BOT controls during each stage of the BOT lifecycle including build, deployment and retirement<br/><br/><br/><br/>Security and Configuration Management<br/><br/>Introduction and Importance: The management and control of configurations for an information system to enable security and manage risks is called security and configuration management. <br/>Key Risks: Inadequate security and configuration mechanisms may lead to-<br/>Hackers exploiting vulnerabilities of the IT systems and this in-turn can lead to security Incidents and data breaches which may pose as huge reputational and financial risk to the organization. Further, weak authentication and physical security can encourage unauthorized access to systems and physical facilities. <br/>Key components- The following are some key components of this domain: <br/>— Password management - A set of principles and best practices to be followed by users while setting, storing and managing passwords. <br/>— Authentication mechanisms - The process of verifying the identity and eligibility of a user to access a particular IT system. <br/>— Anti-virus and anti-malware – Application software deployed at end points to detect and potentially eliminate virus and malware code before damage is done and, repair or quarantine files that have already been infected. <br/>— Vulnerability assessment – An automated process to proactively identify security weaknesses in a network or individual system <br/>— Penetration testing – A live simulated test of the effectiveness of IT system security defenses through mimicking the actions of real-life attackers <br/>— System Hardening – A process to eliminate security risks by removing all nonessential software programs, protocols, services and utilities from the system<br/><br/><br/><br/>Third Party Assurance<br/><br/>Introduction and Importance: Third party assurance is an independent audit of a third-party service organization with the objective of providing assurance that their internal control structure is adequate and meets the organization’s requirements.<br/>Key Risks: Lack of adequate controls in service provider organizations as per the organization’s needs, may result in security incidents and loss of data<br/>Key components- Key components of this domain are:<br/>— Vendor compliance review - A process by which an organization assesses and reviews the potential IT risks of outsourcing services to a third-party<br/>— Review of Contracts and reports- Periodic review of contracts and other external assurance reports is crucial to ensure that third parties confirm to organization’s security standards<br/><br/><br/><br/>Software Asset Management<br/><br/>Introduction and Importance: Software Asset Management is a business practice that involves managing and optimizing the purchase, deployment, maintenance, utilization, and disposal of software applications within an organization.<br/>Key risks: Not managing software assets and monitoring their licenses effectively may lead to non-compliance against licensing agreements and financial losses due to over or underutilization of licenses.<br/>Key components- Key components of License management include: <br/>— Software Development Lifecycle or SDLC - A process for planning, creating, testing, and deploying a software<br/>— License management – Processes and tools used to control and document the organization’s software licenses, and identify over or under utilization"
   },
    {  
      "subheading":"Knowledge Check",
       "name":"Knowledge Check",
      "id":3,
	  "type":"activity",
      "url":"templates/slide12_1.html",
      "transcript":"Here is an activity for you. Match the following key components to their respective domains. Drag and drop the options to their corresponding domains and click submit."
   },
    {  
      "subheading":"Summary",
       "name":"Summary",
      "id":4,
	  "type":"animation",
      "url":"templates/slide13.html",
      "transcript":"Summary!<br/><br/>In this course, we have learnt<br/><br/>1. The various domains of IT MICS and what they cover<br/>2. Key risks addressed by each of these domains<br/>3. Key components and areas covered in the IT MICS domains<br/><br/>For more information, please reach out to: IT MICS Support Team at itmics.support@ab-inbev.com"
   },
    {  
      "subheading":"Assessment",
       "name":"Assessment",
      "id":5,
	  "type":"activity",
      "url":"templates/assessment.html",
      "transcript":"You will be provided with a set of 5 questions which you are required to answer based on your learnings from this module.<br/><br/>Thank for you completing the training on IT MICS for Control Owners: Foundation! Please select any of the following options."
   } 
]